app/services/streak_calculator.rb

  def checked_in_dates_set(last_n_days: 7)
    start_date = reference_date - (last_n_days - 1).days
    checkin_dates = Checkin.where(habit: habit)
                           .where("occurred_on >= ?", start_date)
                           .pluck(:occurred_on)
                           .to_set
---
SELECT "checkins"."occurred_on" FROM "checkins" WHERE "checkins"."habit_id" = $1 AND (occurred_on >= '2026-01-14')  [["habit_id", 3]]

  def checked_in_dates
    @checked_in_dates ||= Checkin.where(habit: habit)
                                  .where("occurred_on <= ?", reference_date)
                                  .pluck(:occurred_on)
                                  .to_set
---
SELECT "checkins"."occurred_on" FROM "checkins" WHERE "checkins"."habit_id" = $1 AND (occurred_on <= '2026-01-20')  [["habit_id", 3]]