app/services/habits/archive_service.rb

    def archive
      habit.update_column(:archived_at, Time.current)
---
UPDATE "habits" SET "archived_at" = $1 WHERE "habits"."id" = $2  [["archived_at", "2026-02-04 12:56:42.453914"], ["id", 11]]