app/services/streak_calculator/checked_in_dates.rb

SELECT "checkins"."occurred_on" FROM "checkins" WHERE "checkins"."habit_id" = $1 AND (occurred_on >= '2026-01-27')  [["habit_id", 2]]
---
    def in_range(last_n_days:)
      start_date = reference_date - (last_n_days - 1).days
      raw = Checkin.where(habit: habit)
                   .where("occurred_on >= ?", start_date)
                   .pluck(:occurred_on)
                   .to_set

SELECT "checkins"."occurred_on" FROM "checkins" WHERE "checkins"."habit_id" = $1 AND (occurred_on <= '2026-02-02')  [["habit_id", 2]]
---
    def load_dates_up_to_reference
      Checkin.where(habit: habit)
             .where("occurred_on <= ?", reference_date)
             .pluck(:occurred_on)
             .to_set