app/queries/habits_dashboard_query.rb

  def active_habits
    @active_habits ||= user.habits.active.includes(:checkins).order(created_at: :desc)
---
SELECT "checkins".* FROM "checkins" WHERE "checkins"."habit_id" IN ($1, $2)  [["habit_id", 2], ["habit_id", 1]]

  def checkins_by_habit_id
    @checkins_by_habit_id ||= Checkin.where(habit: active_habits)
                                     .where(occurred_on: week_start_date..today_date)
                                     .includes(:habit)
                                     .group_by(&:habit_id)
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]

  def today_completion_count
    Checkin.where(user: user, occurred_on: today_date).count
---
SELECT COUNT(*) FROM "checkins" WHERE "checkins"."user_id" = $1 AND "checkins"."occurred_on" = $2  [["user_id", 1], ["occurred_on", "2026-01-20"]]