app/controllers/checkins_controller.rb

  def toggle
    date_param = params[:date] || today_in_user_timezone
    date = Date.parse(date_param.to_s)

    checkin = Checkin.find_by(habit: @habit, occurred_on: date)

    if checkin
      checkin.destroy
      action = :destroyed
    else
      checkin = Checkin.create!(habit: @habit, user: current_user, occurred_on: date)
---
SELECT "checkins".* FROM "checkins" WHERE "checkins"."habit_id" = $1 AND "checkins"."occurred_on" = $2 LIMIT $3  [["habit_id", 2], ["occurred_on", "2026-01-17"], ["LIMIT", 1]]
DELETE FROM "checkins" WHERE "checkins"."id" = $1  [["id", 24]]
INSERT INTO "checkins" ("habit_id", "user_id", "occurred_on", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["habit_id", 2], ["user_id", 1], ["occurred_on", "2026-01-17"], ["created_at", "2026-01-20 10:52:56.270748"], ["updated_at", "2026-01-20 10:52:56.270748"]]

  def set_habit
    @habit = current_user.habits.find(params[:habit_id])
---
SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1 AND "habits"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]