app/controllers/habits_controller.rb

INSERT INTO "habits" ("user_id", "name", "goal_per_week", "start_date", "archived_at", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @habit = current_user.habits.build(habit_params)

    if @habit.save

DELETE FROM "habits" WHERE "habits"."id" = $1  [["id", 7]]
---
  def destroy
    @habit.destroy

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1 AND "habits"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def set_habit
    @habit = current_user.habits.find(params[:id])