app/controllers/habits_controller.rb

  def archived
    @habits = current_user.habits.archived.order(archived_at: :desc)
---
SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1 AND "habits"."archived_at" IS NOT NULL ORDER BY "habits"."archived_at" DESC  [["user_id", 1]]

  def update
    if @habit.update(habit_params)
---
UPDATE "habits" SET "archived_at" = $1 WHERE "habits"."id" = $2  [["archived_at", nil], ["id", 3]]

  def calendar
    today = Time.use_zone(current_user.timezone) { Time.zone.today }
    @month = begin
      params[:month].present? ? Date.parse(params[:month]) : today
    rescue ArgumentError
      today
    end
    @month = @month.beginning_of_month
    @checked_dates = @habit.checkins.pluck(:occurred_on).to_set
---
SELECT "checkins"."occurred_on" FROM "checkins" WHERE "checkins"."habit_id" = $1  [["habit_id", 44]]