app/controllers/settings_controller.rb

UPDATE "users" SET "timezone" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["timezone", "International Date Line West"], ["updated_at", "2026-01-20 10:53:07.129564"], ["id", 1]]
---
  def update
    @user = current_user

    if @user.update(settings_params)