app/services/checkins/toggle_service.rb

    def find_checkin
      Checkin.find_by(habit: habit, occurred_on: date)
---
SELECT "checkins".* FROM "checkins" WHERE "checkins"."habit_id" = $1 AND "checkins"."occurred_on" = $2 LIMIT $3  [["habit_id", 1], ["occurred_on", "2026-01-27"], ["LIMIT", 1]]

    def destroy_checkin(checkin)
      checkin.destroy!
---
DELETE FROM "checkins" WHERE "checkins"."id" = $1  [["id", 29]]

    def create_checkin
      checkin = Checkin.create!(habit: habit, user: user, occurred_on: date)
---
INSERT INTO "checkins" ("habit_id", "user_id", "occurred_on", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["habit_id", 1], ["user_id", 1], ["occurred_on", "2026-01-27"], ["created_at", "2026-02-02 18:59:40.447613"], ["updated_at", "2026-02-02 18:59:40.447613"]]