app/controllers/concerns/habit_loading.rb

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1 AND "habits"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 44], ["LIMIT", 1]]
---
  def set_habit
    @habit = Habit.where(user: current_user).find(params[:id])