app/views/habits/show.html.erb

SELECT "checkins"."occurred_on" FROM "checkins" WHERE "checkins"."habit_id" = $1 AND "checkins"."occurred_on" BETWEEN $2 AND $3  [["habit_id", 3], ["occurred_on", "2026-01-14"], ["occurred_on", "2026-01-20"]]
---
<% week_start = today - 6.days %>
<% checkins = @habit.checkins.where(occurred_on: week_start..today).pluck(:occurred_on).to_set %>

SELECT COUNT(*) FROM "checkins" WHERE "checkins"."habit_id" = $1  [["habit_id", 3]]
---
        <p class="text-sm font-semibold text-gray-700 mb-1">Total Check-ins</p>
        <p class="text-lg text-gray-900"><%= @habit.checkins.count %></p>